verifications/region1-water/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 5.0e6;

boundaryField
{
    left
    {
        type            fixedFluxPressure;
        rho             rho;
        value           $internalField;
    }
    
    right
    {
        type            fixedValue;
        rho             rho;
        value           uniform 5.0e6;
    }

    "frontAndBack|topAndBottom"
    {
        type            empty;
    }
}

// ************************************************************************* //
