verifications/region1-water/Allrun
#!/bin/sh

cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allmesh

runApplication $(getApplication)

postProcess -func sampleDict -latestTime > log.sampleDict
